Curso Pandas Platzi

In [1]:
import pandas as pd
import numpy as np
import datetime as dt  # work with dates in meteorite dataframe

In [69]:
stationary = pd.Series([2.5,3.6,4.8,12.5], index=['Boli','Cuaderno','Folios','Compás']) # create a pandas series using a list

Get the values and the index names

In [70]:
stationary.values

array([ 2.5,  3.6,  4.8, 12.5])

In [71]:
stationary.index

Index(['Boli', 'Cuaderno', 'Folios', 'Compás'], dtype='object')

In [72]:
stationary.shape  # dimensions of series

(4,)


Select one or several elements of series accesing series with slice notation: [ ]

In [73]:
stationary['Cuaderno']

3.6

In [74]:
stationary[['Boli','Folios']]  # several elements using a list of indexes

Boli      2.5
Folios    4.8
dtype: float64

Define a pandas series using a dictionary

In [75]:
dic = {'Boli': 2.5,'Cuaderno': 3.6, 'Paquete folios': 4.8, 'Compás': 12.5}
papel = pd.Series(dic)
papel

Boli               2.5
Cuaderno           3.6
Paquete folios     4.8
Compás            12.5
dtype: float64

Name a column of data

In [76]:
papel.name = 'Precios papelería'
papel

Boli               2.5
Cuaderno           3.6
Paquete folios     4.8
Compás            12.5
Name: Precios papelería, dtype: float64

Add a new index, just adding an index to index list

In [77]:
# use .to_list() method to transform an index object into a list
new_index = papel.index.to_list()
new_index[new_index.index('Paquete folios')] = 'Lápiz'  # find index of 'Paquete folios' and change this element with 'Lápiz'
papel.index
new_index

['Boli', 'Cuaderno', 'Lápiz', 'Compás']

In [78]:
# redefine the index of the series
print(dic)
papel = pd.Series(dic, index = new_index)
papel

{'Boli': 2.5, 'Cuaderno': 3.6, 'Paquete folios': 4.8, 'Compás': 12.5}

Boli         2.5
Cuaderno     3.6
Lápiz        NaN
Compás      12.5
dtype: float64

In the above result, as 'Lápiz' was not a key in the dictionary, an index called 'Lápiz' will be created, but filled with NaN value.

In [79]:
type(papel['Lápiz'])  # NaN is a numpy object

numpy.float64

Check if an element is null: `.isnull()` and `.notnull()

In [80]:
papel.isnull()

Boli        False
Cuaderno    False
Lápiz        True
Compás      False
dtype: bool

In [81]:
papel.notnull()

Boli         True
Cuaderno     True
Lápiz       False
Compás       True
dtype: bool

In [82]:
dict_data = {
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dict_data

{'edad': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9.0]}

A dataframe can be created using a dictionary filled with lists

In [83]:
df = pd.DataFrame(dict_data)
df

   edad   cm pais genero    Q1   Q2
0    10  115   co      M   5.0  7.0
1     9  110   mx      F  10.0  9.0
2    13  130   co      F   8.0  9.0
3    14  155   mx      M   NaN  8.0
4    12  125   mx      M   7.0  8.0
5    11  120   ch      M   8.0  8.0
6    12  125   ch      F   3.0  9.0

In [84]:
df[2:5]  # access indexes using a slice

   edad   cm pais genero   Q1   Q2
2    13  130   co      F  8.0  9.0
3    14  155   mx      M  NaN  8.0
4    12  125   mx      M  7.0  8.0

In [85]:
names = ['ana','benito','camilo','daniel','erika','fabian','gabriela']
print('Original indexes:', end=' ')
print(df.index)
df.index = names
print('New indexes:', end=' ')
df.index

Original indexes: RangeIndex(start=0, stop=7, step=1)
New indexes:

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

Columns of dataframe

In [86]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

Get data of 'edad', 'cm' and 'Q1'

In [87]:
df[['edad','cm','Q1']]

          edad   cm    Q1
ana         10  115   5.0
benito       9  110  10.0
camilo      13  130   8.0
daniel      14  155   NaN
erika       12  125   7.0
fabian      11  120   8.0
gabriela    12  125   3.0

Get an specific index from dataframe.

In [88]:
df.loc['erika']  # use the index value

edad       12
cm        125
pais       mx
genero      M
Q1        7.0
Q2        8.0
Name: erika, dtype: object

The output will be a pandas Series

In [89]:
type(df.loc['daniel'])

pandas.core.series.Series

In [90]:
df.loc['daniel','edad']  # get a single value from an index

14

Retrive a value inside dataframe using its coordinates: `pd.iloc(row,column')`

In [91]:
df.iloc[4,2] # get 'pais' from index 'erika' --> 'mx'

'mx'

In [92]:
df.iloc[1,[0,5]]  # get 'edad' and 'Q2' values

edad      9
Q2      9.0
Name: benito, dtype: object

At above output, the index name of that index becomes the name for output pd Series

Use of masks to retrieve data from df

In [93]:
mask = df['edad'] >= 12
print('Edad > 12')
print(mask)
print('Records that fulfill age criterium:')
df[mask]

Edad > 12
ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool
Records that fulfill age criterium:

          edad   cm pais genero   Q1   Q2
camilo      13  130   co      F  8.0  9.0
daniel      14  155   mx      M  NaN  8.0
erika       12  125   mx      M  7.0  8.0
gabriela    12  125   ch      F  3.0  9.0

Alternatively we can retrive data fulfilling criteria using `.query()` method

In [94]:
df.query('edad > 12')

        edad   cm pais genero   Q1   Q2
camilo    13  130   co      F  8.0  9.0
daniel    14  155   mx      M  NaN  8.0

In [95]:
mask = df['Q1'] <= df['Q2']  # students who improved their marks
df[mask]

          edad   cm pais genero   Q1   Q2
ana         10  115   co      M  5.0  7.0
camilo      13  130   co      F  8.0  9.0
erika       12  125   mx      M  7.0  8.0
fabian      11  120   ch      M  8.0  8.0
gabriela    12  125   ch      F  3.0  9.0

Use numpy method `np.where(condition, value if True, value if False)` to estimate percentage of improvement in marks

In [96]:
df['Mejora, %'] = np.where(df['Q2'] > df['Q1'],  (df['Q2']-df['Q1'])/df['Q1']*100, np.nan)

In [97]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2', 'Mejora, %'], dtype='object')

Change visualization of data `dataframe.style.format`

In [98]:
# find out how to adjust numerical precision
df.style.format(na_rep='MISS', subset=['Q1', 'Q2', 'Mejora, %']).format(precision=2, subset=['Mejora, %']).format(precision=0, subset=['Q1', 'Q2'])

In [99]:
# show only students who have improved their marks
df[ df['Mejora (%)'].notnull() ]

KeyError: 'Mejora (%)'

In [102]:
# use index=False not to store the index in the csv file
df.to_csv('student_marks.csv')

In [103]:
df2 = pd.read_csv('student_marks.csv')
df2

  Unnamed: 0  edad   cm pais genero    Q1   Q2   Mejora, %
0        ana    10  115   co      M   5.0  7.0   40.000000
1     benito     9  110   mx      F  10.0  9.0         NaN
2     camilo    13  130   co      F   8.0  9.0   12.500000
3     daniel    14  155   mx      M   NaN  8.0         NaN
4      erika    12  125   mx      M   7.0  8.0   14.285714
5     fabian    11  120   ch      M   8.0  8.0         NaN
6   gabriela    12  125   ch      F   3.0  9.0  200.000000

In [ ]:
df.to_excel('student_marks.xlsx', index=False, sheet_name = 'Marks')

In [ ]:
df.to_json('student_marks.json')

In [ ]:
pd.read_json('student_marks.json')

In [ ]:
!mv Meteorite_Landings.csv meteorite_landings.csv

In [2]:
meteo = pd.read_csv('meteorite_landings.csv')
meteo.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [ ]:
meteo.tail()

In [ ]:
meteo.sample()  # shows a random label

In [105]:
# some statistics about different variables from dataframe
meteo.describe()

                 id      mass (g)        reclat       reclong
count  45716.000000  4.558500e+04  38401.000000  38401.000000
mean   26889.735104  1.327808e+04    -39.122580     61.074319
std    16860.683030  5.749889e+05     46.378511     80.647298
min        1.000000  0.000000e+00    -87.366670   -165.433330
25%    12688.750000  7.200000e+00    -76.714240      0.000000
50%    24261.500000  3.260000e+01    -71.500000     35.666670
75%    40656.750000  2.026000e+02      0.000000    157.166670
max    57458.000000  6.000000e+07     81.166670    354.473330

In [106]:
# remove the column of id statistics from results of .describe()
stats = meteo.describe().drop('id', axis='columns')
pd.options.display.float_format = '{:,.2f}'.format
stats

           mass (g)    reclat   reclong
count     45,585.00 38,401.00 38,401.00
mean      13,278.08    -39.12     61.07
std      574,988.88     46.38     80.65
min            0.00    -87.37   -165.43
25%            7.20    -76.71      0.00
50%           32.60    -71.50     35.67
75%          202.60      0.00    157.17
max   60,000,000.00     81.17    354.47

In [107]:
meteo.describe(include='all')  # include all kind of variables in the description

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
count,45716,"45,716.00",45716,45716,"45,585.00",45716,45425,"38,401.00","38,401.00",38401
unique,45716,NaN,2,466,NaN,2,266,NaN,NaN,17100
top,Aachen,NaN,Valid,L6,NaN,Found,01/01/2003 12:00:00 AM,NaN,NaN,"(0.0, 0.0)"
freq,1,NaN,45641,8285,NaN,44609,3323,NaN,NaN,6214
mean,NaN,"26,889.74",NaN,NaN,"13,278.08",NaN,NaN,-39.12,61.07,NaN
std,NaN,"16,860.68",NaN,NaN,"574,988.88",NaN,NaN,46.38,80.65,NaN
min,NaN,1.00,NaN,NaN,0.00,NaN,NaN,-87.37,-165.43,NaN
25%,NaN,"12,688.75",NaN,NaN,7.20,NaN,NaN,-76.71,0.00,NaN
50%,NaN,"24,261.50",NaN,NaN,32.60,NaN,NaN,-71.50,35.67,NaN
75%,NaN,"40,656.75",NaN,NaN,202.60,NaN,NaN,0.00,157.17,NaN
max,NaN,"57,458.00",NaN,NaN,"60,000,000.00",NaN,NaN,81.17,354.47,NaN

In [108]:
meteo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

In [109]:
meteo.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year            object
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [110]:
# convert automatically dtypes so the memory use is optimized
meteo.convert_dtypes().dtypes

name            string
id               Int64
nametype        string
recclass        string
mass (g)       Float64
fall            string
year            string
reclat         Float64
reclong        Float64
GeoLocation     string
dtype: object

In [111]:
meteo.nunique() # count how many unique values has each column

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             266
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

In [112]:
meteo[['nametype', 'fall']].head()

  nametype  fall
0    Valid  Fell
1    Valid  Fell
2    Valid  Fell
3    Valid  Fell
4    Valid  Fell

Set values to category type

In [113]:
# convert to category variable both 'fell' and 'nametype'
meteo[['fall', 'nametype']] = meteo[['fall', 'nametype']].astype('category')

In [114]:
meteo.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

Show what unique values there are in a series

In [142]:
meteo['fall'].unique()  # find out what the possible different values of column 'fall'

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [3]:
# figure out the percentage of found meteorites
impacts = meteo['fall'].shape[0]
found = meteo[ meteo['fall'] == 'Found' ].shape[0]
percent_found = found / impacts * 100
print(f'{percent_found:.2f} % of the meteorite impacts where found.')

97.58 % of the meteorite impacts where found.

Dummie values

In [4]:
# set the category var 'fall' to binary values:
# 1 if value is fell
# 0 if value is found
pd.get_dummies(meteo['fall'])

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

Create a column with labels "Fell" and "Found" and set their values to the result of dummie values

In [5]:
meteo[['Fell', 'Found']] = pd.get_dummies(meteo['fall'])
meteo.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation,Fell,Found
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)",1,0
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)",1,0
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)",1,0
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)",1,0
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)",1,0

Set dtypes to something more addecuate to every column

In [164]:
meteo.dtypes

name             object
id                int64
nametype       category
recclass         object
mass, g         float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
Fell              uint8
Found             uint8
dtype: object

Rename a column label

In [6]:
# rename a column using DataFrame.rename(). Use a dictionary: 'old_name':'new_name'
meteo.rename(columns={'mass (g)': 'mass, g'}, inplace=True)
meteo.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass, g', 'fall', 'year',
       'reclat', 'reclong', 'GeoLocation', 'Fell', 'Found'],
      dtype='object')

Working with date values inside DataFrame: `pd.to_datetime()`

In [7]:
dates = meteo['year']
dates.head()  # dtype: object means is 'string'

0    01/01/1880 12:00:00 AM
1    01/01/1951 12:00:00 AM
2    01/01/1952 12:00:00 AM
3    01/01/1976 12:00:00 AM
4    01/01/1902 12:00:00 AM
Name: year, dtype: object

In [9]:
dates = pd.to_datetime(dates, errors='coerce', format='%m/%d/%Y %H:%M:%S %p')
# figure out how many dates are out of range of pandas
# if date is out of maximum range handled by pandas
# value is set to nan
dates[dates.isnull()].shape

(312,)

In [200]:
dates[0].year # index attribute for timestamp index

1880

In [11]:
dates.dt.year  # dt.year attribute for Series

0       1880
1       1951
2       1952
3       1976
4       1902
        ...
45711   1990
45712   1999
45713   1939
45714   2003
45715   1976
Name: year, Length: 45716, dtype: float64

In [10]:
pd.options.display.float_format = '{:.0f}'.format

In [12]:
dates.head()

0   1880-01-01 12:00:00
1   1951-01-01 12:00:00
2   1952-01-01 12:00:00
3   1976-01-01 12:00:00
4   1902-01-01 12:00:00
Name: year, dtype: datetime64[ns]

In [13]:
dates.dt.date

0        1880-01-01
1        1951-01-01
2        1952-01-01
3        1976-01-01
4        1902-01-01
            ...
45711    1990-01-01
45712    1999-01-01
45713    1939-01-01
45714    2003-01-01
45715    1976-01-01
Name: year, Length: 45716, dtype: object

meteo = meteo.rename(columns={'year': 'fall date'})

In [31]:
meteo['fall date'] = pd.to_datetime(meteo['fall date'])

Recent meteorites falls in the 21st century

In [56]:
year = meteo['fall date']
mask1 = dt.datetime(2000,1,1) <= year
mask2 = dt.datetime(2022,12,1) >= year
recent_meteorites = meteo[mask1 & mask2].sort_values(by='fall date')
print(f'Percentage of recent meteorites: {recent_meteorites.shape[0]/meteo.shape[0]*100:.2f} %')

Percentage of recent meteorites: 43.14 %

Sorting values in dataframe

In [61]:
meteo.sample(15).sort_values(by='mass, g')

,name,id,nametype,recclass,"mass, g",fall,fall date,reclat,reclong,GeoLocation,Fell,Found
3321,Allan Hills A81232,2191,Valid,H5,5,Found,1981-01-01,-77,159,"(-76.68722, 159.35639)",0,1
25372,Miller Range 090295,54963,Valid,L5,6,Found,2009-01-01,0,0,"(0.0, 0.0)",0,1
27574,Northwest Africa 2604,33125,Valid,H6,7,Found,2004-01-01,0,0,"(0.0, 0.0)",0,1
31933,Pecora Escarpment 91447,18738,Valid,H5,8,Found,1991-01-01,-86,-68,"(-85.66111, -68.35643)",0,1
38783,Yamato 74357,24735,Valid,Lodranite-an,14,Found,1974-01-01,-72,36,"(-71.74722, 35.80556)",0,1
39005,Yamato 74577,24955,Valid,H6,14,Found,1974-01-01,0,36,"(0.0, 35.66667)",0,1
31963,Pecora Escarpment 91477,18768,Valid,EH3,16,Found,1991-01-01,-86,-69,"(-85.65128, -68.61946)",0,1
29225,Northwest Africa 5219,47337,Valid,Martian (shergottite),60,Found,2007-01-01,0,0,"(0.0, 0.0)",0,1
36722,Sahara 99995,23077,Valid,H6,61,Found,1999-01-01,NaN,NaN,NaN,0,1
6036,Dar al Gani 263,5811,Valid,H4,151,Found,1997-01-01,27,16,"(27.1885, 16.31483)",0,1
27487,Northwest Africa 2454,31033,Valid,H5/6,222,Found,2004-01-01,NaN,NaN,NaN,0,1
30829,Northwest Africa 857,17882,Valid,H6,345,Found,2000-01-01,NaN,NaN,NaN,0,1
7492,Dhofar 1687,56193,Valid,L6,395,Found,2011-01-01,18,54,"(18.0901, 54.08788)",0,1
25181,Miller Range 090102,55877,Valid,L6,511,Found,2009-01-01,0,0,"(0.0, 0.0)",0,1
6529,Dar al Gani 758,6305,Valid,L6,2223,Found,1999-01-01,28,16,"(27.76767, 15.94067)",0,1

In [62]:
bikes = pd.read_csv('london_shared_bikes.csv')

[London bike sharing](url 'https://www.kaggle.com/datasets/hmavrodiev/london-bike-sharing-dataset?resource=download&select=london_merged.csv')  
"timestamp" - timestamp field for grouping the data  
"cnt" - the count of a new bike shares  
"t1" - real temperature in C  
"t2" - temperature in C "feels like"  
"hum" - humidity in percentage  
"windspeed" - wind speed in km/h  
"weathercode" - category of the weather  
"isholiday" - boolean field - 1 holiday / 0 non holiday  
"isweekend" - boolean field - 1 if the day is weekend  
"season" - category field meteorological seasons: 0-spring ; 1-summer; 2-fall; 3-winter.  

"weather_code" category description:  
1 = Clear ; mostly clear but have some values with haze/fog/patches of fog/ fog in vicinity  
2 = scattered clouds / few clouds  
3 = Broken clouds  
4 = Cloudy  
7 = Rain/ light Rain shower/ Light rain  
10 = rain with thunderstorm  
26 = snowfall  
94 = Freezing Fog

In [69]:
bikes_bk = bikes.copy(deep=True)

In [70]:
bikes.dtypes

timestamp        object
cnt               int64
t1              float64
t2              float64
hum             float64
wind_speed      float64
weather_code    float64
is_holiday      float64
is_weekend      float64
season          float64
dtype: object

In [68]:
bikes.convert_dtypes().dtypes

timestamp        string
cnt               Int64
t1              Float64
t2              Float64
hum             Float64
wind_speed      Float64
weather_code      Int64
is_holiday        Int64
is_weekend        Int64
season            Int64
dtype: object

In [75]:
bikes[['is_holiday','is_weekend']] = bikes[['is_holiday','is_weekend']].astype(bool)

In [82]:
bikes['weather_code'] = bikes['weather_code'].astype(int)

In [102]:
# 7 = Rain/ light Rain shower/ Light rain
# 10 = rain with thunderstorm
# 26 = snowfall
# 94 = Freezing Fog
mask = [i in [7,10] for i in bikes['weather_code'] ]
rainy_day_rents = bikes[mask].shape[0]
rainy_day_rents

2155

Some statistics about wind speed:

In [110]:
bikes['wind_speed'].describe()

count   17414
mean       16
std         8
min         0
25%        10
50%        15
75%        20
max        56
Name: wind_speed, dtype: float64

In [109]:
windy_day_rents = bikes[ bikes['wind_speed'] >= 20 ].shape[0] 
print(f'There were {windy_day_rents} bike rents on windy days (wind speed over 20 km/h).')
print(f'That\'s {windy_day_rents / bikes.notnull().shape[0] * 100:.2f} %')

There were 4876 bike rents on windy days (wind speed over 20 km/h).
That's 28.00 %

Convert km/h to m/s using a function and apply it to dataframe

In [113]:
def speed_ms(speed):
    return speed/3.6
bikes['wind speed (m/s)'] = bikes['wind_speed'].apply(speed_ms)
bikes.sample(5)

,timestamp,cnt,t1,t2,hum,wind_speed,weather_code,is_holiday,is_weekend,season,wind speed (m/s)
13273,2016-07-13 13:00:00,1290,18,18,60,24,7,False,False,1,7
10007,2016-02-27 04:00:00,75,4,2,70,7,3,False,True,3,2
14555,2016-09-06 19:00:00,2661,23,23,74,8,3,False,False,2,2
14238,2016-08-23 01:00:00,201,18,18,80,5,1,False,False,1,1
6624,2015-10-08 00:00:00,245,12,12,70,12,3,False,False,2,3

Reorder columns

In [117]:
bikes.columns

Index(['timestamp', 'cnt', 't1', 't2', 'hum', 'wind_speed', 'weather_code',
       'is_holiday', 'is_weekend', 'season', 'wind speed (m/s)'],
      dtype='object')

In [127]:
print('Old columns list:')
print(list(bikes.columns))
cols = [*bikes.columns[:7], 'season', 'is_holiday', 'is_weekend']
print('Reordered columns list')
print(cols)

Old columns list:
['timestamp', 'cnt', 't1', 't2', 'hum', 'wind_speed', 'weather_code', 'is_holiday', 'is_weekend', 'season', 'wind speed (m/s)']
Reordered columns list
['timestamp', 'cnt', 't1', 't2', 'hum', 'wind_speed', 'weather_code', 'season', 'is_holiday', 'is_weekend']

In [131]:
bikes = bikes.reindex(columns = cols)

In [132]:
bikes.columns

Index(['timestamp', 'cnt', 't1', 't2', 'hum', 'wind_speed', 'weather_code',
       'season', 'is_holiday', 'is_weekend'],
      dtype='object')

In [137]:
bikes.rename(columns =
             {'wind_speed': 'wind speed (km/h)',
              'cnt':'count',
              'timestamp': 'date'},
             inplace=True)

In [138]:
bikes.columns

Index(['date', 'count', 't1', 't2', 'hum', 'wind speed (km/h)', 'weather_code',
       'season', 'is_holiday', 'is_weekend'],
      dtype='object')

In [150]:
bikes['date'] = pd.to_datetime(bikes['date'])
bikes['date'] = bikes['date'].dt.date
bikes['date'].max()

datetime.date(2017, 1, 3)

Create a filter function to extract data from dataframe

In [169]:
def filter(df, season=0, weather=1, weekend=True, holiday=False):
#def filter(df, season=0):
    """
    holiday - boolean field - 1 holiday / 0 non holiday
    weekend - boolean field - 1 if the day is weekend

    season - category field meteorological seasons: 0-spring ; 1-summer; 2-fall; 3-winter.

    weather category description:
    1 = Clear ; mostly clear but have some values with haze/fog/patches of fog/ fog in vicinity
    2 = scattered clouds / few clouds
    3 = Broken clouds
    4 = Cloudy
    7 = Rain/ light Rain shower/ Light rain
    10 = rain with thunderstorm
    26 = snowfall
    94 = Freezing Fog
    """
    mask1 = bikes['season'] == season
    mask2 = bikes['weather_code'] == weather
    mask3 = bikes['is_holiday'] == holiday
    mask4 = bikes['is_weekend'] == weekend
    final_mask = mask1 & mask2 & mask3 & mask4
    return final_mask

In [167]:
help(filter)

Help on function filter in module __main__:

filter(df, season=0)
    holiday - boolean field - 1 holiday / 0 non holiday
    weekend - boolean field - 1 if the day is weekend

    season - category field meteorological seasons: 0-spring ; 1-summer; 2-fall; 3-winter.

    weather category description:
    1 = Clear ; mostly clear but have some values with haze/fog/patches of fog/ fog in vicinity
    2 = scattered clouds / few clouds
    3 = Broken clouds
    4 = Cloudy
    7 = Rain/ light Rain shower/ Light rain
    10 = rain with thunderstorm
    26 = snowfall
    94 = Freezing Fog

In [170]:
mask = filter(bikes, season=2, weather=4, holiday=False, weekend=False)
bikes[mask]

,date,count,t1,t2,hum,wind speed (km/h),weather_code,season,is_holiday,is_weekend
5745,2015-09-01,235,15,15,88,10,4,2,False,False
5838,2015-09-04,732,14,14,61,7,4,2,False,False
5839,2015-09-04,677,14,14,63,8,4,2,False,False
5840,2015-09-04,584,14,14,63,8,4,2,False,False
5914,2015-09-08,148,13,13,82,6,4,2,False,False
...,...,...,...,...,...,...,...,...,...,...
16526,2016-11-28,152,8,6,62,14,4,2,False,False
16527,2016-11-28,92,8,6,62,14,4,2,False,False
16528,2016-11-28,59,8,6,62,14,4,2,False,False
16529,2016-11-28,27,8,5,62,15,4,2,False,False
16530,2016-11-28,35,8,6,62,12,4,2,False,False